export type tGroup = {
  id: number;
  Дистрибутив: string | number;
  "Год выпуска": number;
  Активность: number;
  Рейтинг: number;
}[];

export const dists: tGroup = [
  {
    id: 1,
    Дистрибутив: "Ubuntu",
    "Год выпуска": 2004,
    Активность: 9,
    Рейтинг: 9,
  },
  {
    id: 2,
    Дистрибутив: "Arch Linux",
    "Год выпуска": 2002,
    Активность: 8,
    Рейтинг: 8,
  },
  {
    id: 3,
    Дистрибутив: "Fedora",
    "Год выпуска": 2003,
    Активность: 8,
    Рейтинг: 7,
  },
  {
    id: 4,
    Дистрибутив: "Debian",
    "Год выпуска": 1993,
    Активность: 9,
    Рейтинг: 9,
  },
  {
    id: 5,
    Дистрибутив: "openSUSE",
    "Год выпуска": 2005,
    Активность: 7,
    Рейтинг: 7,
  },
  {
    id: 6,
    Дистрибутив: "Linux Mint",
    "Год выпуска": 2006,
    Активность: 8,
    Рейтинг: 8,
  },
  {
    id: 7,
    Дистрибутив: "Gentoo",
    "Год выпуска": 2000,
    Активность: 6,
    Рейтинг: 6,
  },
  {
    id: 8,
    Дистрибутив: "Slackware",
    "Год выпуска": 1993,
    Активность: 5,
    Рейтинг: 5,
  },
];

export const year: tGroup = [
  { id: 1, Дистрибутив: 1993, "Год выпуска": 1993, Активность: 7, Рейтинг: 7 },
  { id: 2, Дистрибутив: 2000, "Год выпуска": 2000, Активность: 6, Рейтинг: 6 },
  { id: 3, Дистрибутив: 2002, "Год выпуска": 2002, Активность: 8, Рейтинг: 8 },
  { id: 4, Дистрибутив: 2003, "Год выпуска": 2003, Активность: 8, Рейтинг: 7 },
  { id: 5, Дистрибутив: 2004, "Год выпуска": 2004, Активность: 9, Рейтинг: 9 },
  { id: 6, Дистрибутив: 2005, "Год выпуска": 2005, Активность: 7, Рейтинг: 7 },
  { id: 7, Дистрибутив: 2006, "Год выпуска": 2006, Активность: 8, Рейтинг: 8 },
];

export const type: tGroup = [
  {
    id: 1,
    Дистрибутив: "Для новичков",
    "Год выпуска": 2006,
    Активность: 9,
    Рейтинг: 9,
  }, // Mint/Ubuntu
  {
    id: 2,
    Дистрибутив: "Для разработчиков",
    "Год выпуска": 2003,
    Активность: 8,
    Рейтинг: 8,
  }, // Fedora/Arch
  {
    id: 3,
    Дистрибутив: "Для серверов",
    "Год выпуска": 1993,
    Активность: 9,
    Рейтинг: 9,
  }, // Debian
  {
    id: 4,
    Дистрибутив: "Минималистичные",
    "Год выпуска": 2002,
    Активность: 7,
    Рейтинг: 7,
  }, // Arch/Gentoo
  {
    id: 5,
    Дистрибутив: "Стабильные",
    "Год выпуска": 1993,
    Активность: 8,
    Рейтинг: 8,
  }, // Debian/Slackware
];

